{
  "backend/main.mo": "Motoko canister managing enquiries with submit, get by id, and get-all functions stored in a Map.",
  "feature_evidence.json": "Feature evidence report listing two features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH colors.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with root layout and page routes for all site sections.",
  "frontend/src/components/ImageGalleryGrid.tsx": "Reusable image grid component with modal preview using Dialog.",
  "frontend/src/components/ProjectCard.tsx": "Card component displaying a project's title, location, and description.",
  "frontend/src/components/ServiceCard.tsx": "Card component showing a service with icon, title, and description.",
  "frontend/src/components/SiteFooter.tsx": "Footer with company info, links, contact details, and caffeine.ai attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo and navigation including mobile menu toggle.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper including header, footer, and routed content outlet.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing authenticated or anonymous backend actors with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication via AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useSubmitEnquiry.ts": "Implements a React Query mutation that submits an enquiry through an actor and invalidates the enquiries cache on success.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/lib/validation/enquiryValidation.ts": "Validates enquiry form fields, ensuring required fields, contact info, email format, and minimum message length.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/EnquiryPage.tsx": "Renders a contact form with validation and submits enquiries, also showing direct contact details.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery of project images using an image grid component.",
  "frontend/src/pages/MajorClientsPage.tsx": "Shows a list of major clients and a showcase image highlighting prominent organizations.",
  "frontend/src/pages/MajorProjectsPage.tsx": "Presents major completed and ongoing projects with descriptions and supporting images.",
  "frontend/src/pages/QualitySafetyPolicyPage.tsx": "Renders the Quality and Safety Policy page with an intro, image, and card-based sections detailing quality, safety, and compliance commitments.",
  "frontend/src/pages/ServicesPage.tsx": "Displays the Services page with a hero section, image, and a grid of service cards populated from a local list.",
  "frontend/src/pages/TrustedElectricalContractorsPage.tsx": "Implements the landing page with a hero banner, company overview, highlights, and navigation buttons to services and enquiry pages.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and required plugins.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes for the BM Enterprises website build."
}