{
  "backend/main.mo": "Motoko canister storing enquiries in a map with auto-incrementing IDs, providing submit and query methods.",
  "feature_evidence.json": "Feature evidence report describing removal of an unused download.webp asset with metadata and component references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.css": "Tailwind base layer defining design tokens and dark mode variables for the site's color system.",
  "frontend/index.html": "Basic HTML entry point providing the root container and loading the React main.tsx module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with site routes and renders the RouterProvider.",
  "frontend/src/components/ImageGalleryGrid.tsx": "Responsive image grid component with dialog-based lightbox preview.",
  "frontend/src/components/ProjectCard.tsx": "Card component displaying a project's title, location, and description.",
  "frontend/src/components/ServiceCard.tsx": "Card component showing a service icon, title, and description.",
  "frontend/src/components/SiteFooter.tsx": "Footer with company info, navigation links, contact details, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Header with branding, desktop/mobile navigation, and route-aware highlighting.",
  "frontend/src/components/SiteLayout.tsx": "Layout component wrapping pages with a header, footer, and main outlet.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor, updating on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity, handling AuthClient creation, login state, and identity persistence.",
  "frontend/src/hooks/useSubmitEnquiry.ts": "React Query mutation hook that submits an enquiry through an actor and invalidates the enquiries query on success.",
  "frontend/src/index.css": "Defines global Tailwind layers and theme CSS variables for light and dark modes.",
  "frontend/src/lib/validation/enquiryValidation.ts": "Validates enquiry form fields with required checks, email validation, and minimum message length.",
  "frontend/src/main.tsx": "Application entry point that mounts React, wrapping App with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/EnquiryPage.tsx": "Renders a contact form with validation and uses a mutation hook to submit enquiries, showing success or error states.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery page with a grid of predefined project images.",
  "frontend/src/pages/MajorClientsPage.tsx": "Shows a list of major clients and an accompanying image, styled with cards and icons.",
  "frontend/src/pages/MajorProjectsPage.tsx": "Presents major completed projects and an image gallery of ongoing project photos.",
  "frontend/src/pages/QualitySafetyPolicyPage.tsx": "Renders the Quality and Safety Policy page with sections for quality, safety, and compliance using cards and an image header.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services overview with a grid of ServiceCard components and a header image describing BM Enterprises' electrical offerings.",
  "frontend/src/pages/TrustedElectricalContractorsPage.tsx": "Implements the landing page with a hero section, company overview, highlights, and navigation buttons, plus supporting images.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme settings, color tokens, container options, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata, requirements, issues, features, and architectural notes for the BM Enterprises website."
}