{
  "backend/main.mo": "Motoko canister storing enquiries with incrementing IDs, supporting submission and retrieval operations.",
  "feature_evidence.json": "Feature evidence report listing two frontend feature additions related to Major Projects featured image handling.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in the app’s layout, pages, and components.",
  "frontend/index.css": "Tailwind base and theme variable definitions configuring light/dark mode color tokens and global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and root layout for all site pages.",
  "frontend/src/components/ProjectCard.tsx": "Reusable card component displaying project title, location, and description.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component showing a service icon, title, and description.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying branding, navigation links, contact info, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, navigation links, and mobile menu toggle.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper providing header, routed content outlet, and footer.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing authenticated or anonymous backend actors with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication state and login/logout flows using AuthClient.",
  "frontend/src/hooks/useSubmitEnquiry.ts": "Defines a React Query mutation for submitting enquiries through an actor and invalidates the enquiries query on success.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes across the app.",
  "frontend/src/lib/validation/enquiryValidation.ts": "Validates enquiry form fields for required values, email format, and message length, returning errors if invalid.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/EnquiryPage.tsx": "Implements a contact form with validation, submission via useSubmitEnquiry, and displays direct contact details.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a grid of gallery images with modal dialog previews for each image.",
  "frontend/src/pages/MajorClientsPage.tsx": "Displays a list of major clients with a featured image and client cards.",
  "frontend/src/pages/MajorProjectsPage.tsx": "Renders major project descriptions with a hero image and ProjectCard components.",
  "frontend/src/pages/QualitySafetyPolicyPage.tsx": "Renders the Quality and Safety Policy page with sections for quality commitment, safety practices, and compliance using cards and imagery.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of electrical services using ServiceCard components along with a hero image and intro text.",
  "frontend/src/pages/TrustedElectricalContractorsPage.tsx": "Implements the landing page with a hero section, company overview, and highlight cards promoting BM Enterprises' strengths.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project state, features, requirements, and image needs for the BM Enterprises website."
}