{
  "backend/main.mo": "Defines enquiry and feedback types, stores them in maps, and exposes submit and query functions with ID auto-increment and timestamping.",
  "feature_evidence.json": "Feature evidence record describing a background image addition on the Trusted Electrical Contractors page with related files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including pages, components, hooks, and styling.",
  "frontend/index.css": "Tailwind base overrides defining OKLCH color variables for light and dark themes plus global styling.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and renders the app with SiteLayout and all page components.",
  "frontend/src/components/ImageGalleryGrid.tsx": "Responsive grid component that displays images with modal preview using Dialog components.",
  "frontend/src/components/LegalRegistrationDetails.tsx": "Renders GSTIN, UDYAM, PF, and ESIC legal details with icons.",
  "frontend/src/components/ProjectCard.tsx": "Card component displaying a project's title, location, and description with map pin icon.",
  "frontend/src/components/ServiceCard.tsx": "Card component showing a service icon, title, and description.",
  "frontend/src/components/SiteFooter.tsx": "Footer with company info, quick links, contact details, legal details, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, navigation links, and mobile menu toggle.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useFeedbackList.ts": "Fetches all feedback entries using the authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useSubmitEnquiry.ts": "Submits enquiries via the actor and invalidates enquiry-related queries on success.",
  "frontend/src/hooks/useSubmitFeedback.ts": "Submits feedback via the actor and refreshes feedback queries on success.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme CSS variables.",
  "frontend/src/lib/formatters/time.ts": "Formats bigint timestamps into readable date strings.",
  "frontend/src/lib/validation/enquiryValidation.ts": "Validates enquiry form fields including contact info and message length.",
  "frontend/src/lib/validation/feedbackValidation.ts": "Validates feedback form data such as rating, contact info, and message content.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and Internet Identity providers.",
  "frontend/src/pages/EnquiryPage.tsx": "Implements enquiry and feedback forms with validation, submission, and feedback listing.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery of project images using a grid component.",
  "frontend/src/pages/MajorClientsPage.tsx": "Displays a list of major clients with a header, image, and grid of client cards.",
  "frontend/src/pages/MajorProjectsPage.tsx": "Renders detailed major project descriptions and an image gallery of ongoing project photos.",
  "frontend/src/pages/QualitySafetyPolicyPage.tsx": "Shows quality and safety policy sections with images and cards outlining commitments and standards.",
  "frontend/src/pages/ServicesPage.tsx": "Lists the company's electrical services using service cards and includes a header and featured image.",
  "frontend/src/pages/TrustedElectricalContractorsPage.tsx": "Provides the landing page with hero section, company overview, highlights, and calls to action.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, container settings, and plugin setup.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, and known issues for the BM Enterprises website."
}